clear
clc
 str2=['00.000.100.200.300.400.500.600.701.001.101.201.301.401.501.601.702.002.102.202.302.402.502.602.703.003.103.203.303.403.503.603.704.004.104.204.304.404.504.604.705.005.105.205.305.405.505.605.706.006.106.206.306.406.506.606.707.007.107.207.307.407.507.607.708.008.108.208.308.408.508.608.709.009.109.209.309.409.509.609.710.010.110.210.310.410.510.610.711.011.111.211.311.411.511.611.712.012.112.212.312.412.512.612.713.013.113.213.313.413.513.613.714.014.114.214.314.414.514.614.7']
  
for h=1:120
    str1='D:\Program Files\MATLAB\R2010b\bin\';
    str3=str2(h*4-3:h*4)
    A=dir(strcat(str1,str3));   %将路径下的文件读入结构体A
    
B={};
C=[];
K=[];
P{h}=[];
Q=[];
R=[];
S=[];
addpath(strcat(str1,str3));

for i=1:96
    B{i}=A(i+2).name;                   %dir函数不是按文件名读入文件
B=sortnat(B);                           %这里把所有的文件名都读入B矩阵
end                                     %调用sortnat函数将文件按名称排序再次存入矩阵B

for k=1:96
a=importdata(B{k});                      %读入文件
    for j=1:50
      b=a{j};
      b=str2num(b(30:32));               %提取信号强度信息
      C(j)=b;
     end
      [Value]=tabulate(C);               %取重数
      [m,n]=max(Value(:,2));
        K(k)=Value(n,1);
    
          x=fix((k-1)/16)+1;             
          y=mod(k,16);
          if y==0
              y=16;
          end
          
          P{h}(x,y)=K(k);
          
end


end
          



